app/views/loans/new.html.erb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" INNER JOIN "loans" ON "loans"."reservation_id" = "reservations"."id" WHERE "reservations"."status" = $1 AND "reservations"."id" IS NULL  [["status", 1]]
---
        <div>
          <%= form.select :reservation_id, options_for_select(Reservation.where(status: ["approved"]).collect { |p| [p.book.nil? ? p.journal.title : p.book.title, p.id] }, @loan.reservation_id), {include_blank: 'Select Reservation'}, class: "form-select" %>