app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "language", "publisher", "publish_year", "description", "categories", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @book = Book.new(books_params)

    if @book.save

UPDATE "books" SET "author" = ?, "publish_year" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "leon Tolstoy"], ["publish_year", 2012], ["updated_at", "2021-11-17 02:07:02.882261"], ["id", 1]]
---
  def update
    if @book.update(books_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 3]]
---
  def destroy
    if @book.destroy