app/controllers/home_controller.rb

SELECT "books".* FROM "books" WHERE (title ILIKE '%ki%')
SELECT "journals".* FROM "journals" WHERE (title ILIKE '%ki%')
SELECT "books".* FROM "books" WHERE (title ILIKE '%Test%')
SELECT "journals".* FROM "journals" WHERE (title ILIKE '%Test%')
---
  def index
    @all_books = []

    if params[:search].present?
      if params[:resource_type].present?
        if params[:resource_type] == "All"
          Book.where("title ILIKE ?", "%#{params[:search]}%")&.each do |book|
            @all_books << book
          end
          Journal.where("title ILIKE ?", "%#{params[:search]}%").all&.each do |journal|
            @all_books << journal
          end
        elsif params[:resource_type] == "book"
          Book.where("title ILIKE ?", "%#{params[:search]}%")&.each do |book|
            @all_books << book
          end
        elsif params[:resource_type] == "journal"
          Journal.where("title ILIKE ?", "%#{params[:search]}%").all&.each do |journal|
            @all_books << journal
          end
        end
      else
        Book.where("title ILIKE ?", "%#{params[:search]}%")&.each do |book|
          @all_books << book
        end
        Journal.where("title ILIKE ?", "%#{params[:search]}%").all&.each do |journal|

SELECT "books".* FROM "books"
SELECT "journals".* FROM "journals"
---
    else
      if params[:resource_type].present?
        if params[:resource_type] == "All"
          Book.all&.each do |book|
            @all_books << book
          end
          Journal.all&.each do |journal|
            @all_books << journal
          end
        elsif params[:resource_type] == "book"
          Book.all&.each do |book|
            @all_books << book
          end
        elsif params[:resource_type] == "journal"
          Journal.all&.each do |journal|

SELECT "books".* FROM "books"
SELECT "journals".* FROM "journals"
---
          end
        end
      else
        Book.all&.each do |book|
          @all_books << book
        end
        Journal.all&.each do |journal|