app/controllers/journals_controller.rb

  def index
    @journals = Journal.all
---
SELECT "journals".* FROM "journals"

  def create
    @journal = Journal.new(journals_params)

    if @journal.save
---
INSERT INTO "journals" ("title", "volume", "issue", "language", "publish_year", "publisher", "categories", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    if @journal.destroy
---
DELETE FROM "journals" WHERE "journals"."id" = $1  [["id", 1]]

  def set_journal
    @journal = Journal.find(params[:id])
---
SELECT "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]