app/controllers/loans_controller.rb

SELECT "loans".* FROM "loans"
---
  def index
    @loans = Loan.all

UPDATE "loans" SET "status" = $1, "updated_at" = $2 WHERE "loans"."id" = $3  [["status", 3], ["updated_at", "2021-11-25 04:13:05.468233"], ["id", 3]]
---
  def show
    if @loan.update(loans_params)

SELECT "loans".* FROM "loans" WHERE "loans"."reservation_id" = $1 LIMIT $2  [["reservation_id", 13], ["LIMIT", 1]]
INSERT INTO "loans" ("user_id", "amount", "fine_amount", "due_date", "status", "created_at", "updated_at", "reservation_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    loan = Loan.find_by(reservation_id: loans_params[:reservation_id])

    if loan.nil?
      @loan = Loan.new(loans_params)

      if @loan.save

UPDATE "loans" SET "user_id" = $1, "fine_amount" = $2, "updated_at" = $3 WHERE "loans"."id" = $4  [["user_id", 1], ["fine_amount", 12.0], ["updated_at", "2021-11-30 16:47:53.871230"], ["id", 10]]
---
  def update
    if @loan.update(loans_params)

SELECT "loans".* FROM "loans" WHERE "loans"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def set_loan
    @loan = Loan.find(params[:id])