app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("user_id", "journal_id", "reservation_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["journal_id", 1], ["reservation_date", "2021-11-25"], ["status", 0], ["created_at", "2021-11-25 03:51:40.446294"], ["updated_at", "2021-11-25 03:51:40.446294"]]
---
  def create
    reservation = Reservation.new(reservations_params)
    if reservation.save

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "status" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["status", 1], ["updated_at", "2021-11-17 13:49:16.406010"], ["id", 1]]
---
  def show
    reservation = Reservation.find(params[:id])

    if reservation.update(reservations_params)