app/controllers/users_controller.rb

  def index
    if params[:search].present?
      @users = User.where("name ILIKE ?", "%#{params[:search]}%").all
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE (name ILIKE '%ki%')
SELECT "users".* FROM "users"