app/models/loan.rb

  def make_resource_available
    if status == "closed"
      unless reservation.book_id.nil?
        reservation.book.update(status: "available", booked_at: nil)
---
UPDATE "books" SET "updated_at" = $1, "status" = $2, "booked_at" = $3 WHERE "books"."id" = $4  [["updated_at", "2021-11-30 13:17:37.381302"], ["status", 0], ["booked_at", nil], ["id", 1]]