app/models/reservation.rb

  def set_date
    unless book_id.nil?
      book.update(status: "booked", booked_at: DateTime.current)
    end

    unless journal_id.nil?
      journal.update(status: "booked", booked_at: DateTime.current)
---
UPDATE "books" SET "updated_at" = $1, "status" = $2, "booked_at" = $3 WHERE "books"."id" = $4  [["updated_at", "2021-11-25 03:51:38.256379"], ["status", 1], ["booked_at", "2021-11-25"], ["id", 3]]
UPDATE "journals" SET "updated_at" = $1, "status" = $2, "booked_at" = $3 WHERE "journals"."id" = $4  [["updated_at", "2021-11-25 03:51:40.454707"], ["status", 1], ["booked_at", "2021-11-25"], ["id", 1]]

  def self.cancel_reservation
    Reservation.where(status: "pending").all.each do |reservation|
      if (reservation.created_at + 2.hours).to_s(:time) > DateTime.current.to_s(:time)
        unless reservation.book_id.nil?
          reservation.book.update(status: "booked", booked_at: DateTime.current)
        end

        unless reservation.journal_id.nil?
          reservation.journal.update(status: "booked", booked_at: DateTime.current)
---
UPDATE "journals" SET "updated_at" = $1, "status" = $2, "booked_at" = $3 WHERE "journals"."id" = $4  [["updated_at", "2021-11-25 13:16:38.124896"], ["status", 0], ["booked_at", nil], ["id", 1]]
UPDATE "books" SET "updated_at" = $1, "status" = $2, "booked_at" = $3 WHERE "books"."id" = $4  [["updated_at", "2021-11-25 13:16:55.917730"], ["status", 0], ["booked_at", nil], ["id", 2]]

  def create_loan
    if status == "approved"
      loan = Loan.new(user_id: user_id, reservation_id: id, amount: 20, due_date: (Date.current + 2.weeks), status: "outstanding")
      loan.save
---
INSERT INTO "loans" ("user_id", "amount", "due_date", "status", "created_at", "updated_at", "reservation_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["amount", 20.0], ["due_date", "2021-12-09"], ["status", 1], ["created_at", "2021-11-25 03:52:46.267231"], ["updated_at", "2021-11-25 03:52:46.267231"], ["reservation_id", 6]]