app/models/user.rb

  def set_role
    self.role = Role.find_by(name: "user") if role_id.nil?
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "user"], ["LIMIT", 1]]

  def self.from_omniauth(auth)
    where(email: auth.info.email).first_or_initialize do |user|
      user.name = auth.info.name
      user.email = auth.info.email
      user.password = 'password'
      user.surname = auth.info.name
      user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "16m124@kce.ac.in"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "role_id", "name", "surname") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"